# IsValidFilterString Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FileDialog..::..IsValidFilterString Method
FileDialog Class See Also
---
Determines if the input string is acceptable as input for a FileDialog filter string.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static bool IsValidFilterString(
	string filterString
)
```

Visual Basic
---
```text
Public Shared Function IsValidFilterString ( _
	filterString As String _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidFilterString(
	String^ filterString
)
```

# ### Parameters
filterString
    Type: System..::..String The filter string.
# ### Return Value
True of the filter string meets the minimal requirements to be a valid filter string.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FileDialog Class
Autodesk.Revit.UI Namespace